ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_getMyeBaySelling_optional.xml

<?xml version="1.0" ?>
<soapenv:Envelope xmlns:ebl="urn:ebay:apis:eBLBaseComponents" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay">
    <soapenv:Header/>
    <soapenv:Body>
    	<urn:method>getMyeBaySelling</urn:method>
        <urn:apiUrl>%s(tradingApiUrl)</urn:apiUrl>
        <urn:appId>%s(appId)</urn:appId>
        <urn:routing>default</urn:routing>
        <urn:authToken>%s(authToken)</urn:authToken>
        <urn:siteId>%s(siteId)</urn:siteId>
        <urn:version>%s(version)</urn:version>
        <urn:activeList>
            <ebl:values>
                <ebl:Include>true</ebl:Include>
            </ebl:values>
        </urn:activeList>
        <urn:soldList>
        	<ebl:values>
        		<ebl:Include>true</ebl:Include>
        	</ebl:values>
        </urn:soldList>
        <urn:errorLanguage>en_US</urn:errorLanguage>
    </soapenv:Body>
</soapenv:Envelope>